# encoding:UTF-8
import math
# 计算建筑物年预计雷击次数
# 定建筑物防雷等级
print("*************************建筑物防雷等级界定系统***********************")

#广州地区的年平均雷暴日
print("广州地区年平均雷暴日：Td=73.1d/a")
Td = 73.1

#选择建筑物的校正系数
print('''选择建筑物所在区域：
1、一般情况下 K=1
2、位于河边、湖边、山坡下或山地中土壤电阻率较小处、地下水
   露头处、土山顶部、山谷风口等处的建筑物，以及特别潮湿的建筑物 K=1.5
3、金属屋面没有接地的砖木结构建筑物 K=1.7
4、位于山顶上或旷野的孤立建筑物 K=2''')
a = input("请按1/2/3/4 : " )
if a == '1' :
  K = 1
elif a == '2' :
  K = 1.5
elif a == '3' :
  K = 1.7
elif a == '4' :
  K = 2
#建筑物的长宽高
print("请输入建筑物的长度(m)：")
L = input("L = ")
L = float(L )
print("请输入建筑物的宽度(m)：")
W = input("W = ")
W = float(W)
print("请输入建筑物的高度(m)：")
H = input("H = ")
H = float(H)
#主要使用的公式H<100M 的时候
Pi = math.pi
Po = math.pow(10,-6)
Ng = 0.1*Td
D = H*(200-H)
D = float(D)
E = D ** 0.5
Ae =((L*W)+(2*(L+W)*E)+(Pi*D))*Po
N = '%.4f'%(K * Ng * Ae)
print ('该建筑物平均雷击次数为:',N)
N = float(N)
# #判断建筑物类别
# if N >= 0.05:
#   print('该建筑物应为二类防雷等级')
# else:
#   print('该建筑物应为三类防雷等级')
